{"keras_version": "2.0.2", "backend": "tensorflow", "config": [{"config": {"trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "batch_input_shape": [null, 100, 100, 3], "activation": "relu", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_7", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_8", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "relu", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "same", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_8", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_10"}, "class_name": "Dropout"}, {"config": {"trainable": true, "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "name": "conv2d_9", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "activity_regularizer": null, "kernel_regularizer": null, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "activation": "relu", "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_9", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "trainable": true, "name": "dropout_11"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_3"}, "class_name": "Flatten"}, {"config": {"trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_5", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 64, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"rate": 0.3, "trainable": true, "name": "dropout_12"}, "class_name": "Dropout"}, {"config": {"trainable": true, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "name": "dense_6", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "units": 133, "activity_regularizer": null, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "softmax"}, "class_name": "Dense"}], "class_name": "Sequential"}